<?php

return [
    'labels' => [
        'general' => 'Общие',
        'security' => 'Безопасность',
    ],
    'user_cabinet_breadcrumb' => 'Личный кабинет',
    'password_change_title' => 'Изменение пароля',
    'password_change_description' => 'Измените пароль вашей учетной записи.',
    '2fa_title' => 'Двухфакторная аутентификация',
    '2fa_description' => 'Управляйте двухфакторной аутентификацией для своей учетной записи (рекомендуется).',
    '2fa_not_enabled_title' => 'Вы не включили двухфакторную аутентификацию.',
    '2fa_not_enabled_description' => 'Включите двухфакторную аутентификацию, чтобы при входе запрашивался безопасный токен. Используйте приложения, такие как Google Authenticator или Microsoft Authenticator.',
    '2fa_enable_button' => 'Включить',
    '2fa_enabling_title' => 'Завершите включение двухфакторной аутентификации.',
    '2fa_enabling_description' => 'Для завершения включения двухфакторной аутентификации отсканируйте следующий QR-код с помощью приложения-аутентификатора на вашем телефоне или введите ключ настройки и предоставьте сгенерированный OTP-код.',
    'setup_key' => 'Ключ настройки',
    'recovery_codes' => 'Эти коды можно использовать для восстановления доступа к вашей учетной записи, если устройство будет потеряно. Внимание! Эти коды будут показаны только один раз.',
    'confirm_and_finish' => 'Подтвердить и завершить',
    'disable' => 'Отключить',
    'enter_code' => 'Введите код',
    '2fa_enabled' => 'Вы включили двухфакторную аутентификацию!',
    '2fa_enabled_description' => 'Двухфакторная аутентификация теперь включена. Это помогает сделать вашу учетную запись более безопасной.',
    'regenerate_recovery_codes' => 'Сгенерировать коды восстановления заново',
    'notifications' => [
        'generate_recovery_codes' => 'Новые коды восстановления были сгенерированы',
        '2fa_enabled' => 'Код подтвержден. Двухфакторная аутентификация включена!',
        '2fa_disabled' => 'Двухфакторная аутентификация была отключена',
        '2fa_enabling_stage' => 'Двухфакторная аутентификация находится на этапе включения.',
    ],
];
